sim/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}


scale 1;

vertices
(
    // Verticies for outer mesh
       (2 -0.414 0)//0
       (1048 0 0)//1
       (1048 120 0)//2
       (2 120 0)//3
       (2 -1.59 0)//4
       (18 -2 0)//5
       (18 -122 0)//6
       (2 -122 0)//7
       (2 -0.414 0.1)//8
       (1048 0 0.1)//9
       (1048 120 0.1)//10
       (2 120 0.1)//11
       (2 -1.59 0.1)//12
       (18 -2 0.1)//13
       (18 -122 0.1)//14
       (2 -122 0.1)//15
       (-118 -1 0)//16
       (-118 -1 0.1)//17
       (0 -1 0)//18
       (0 -1 0.1)//19
       (16.5 0 0)//20
    (16.5 0 0.1)//21
    (16.5 120 0)//22
    (16.5 120 0.1)//23
);

blocks
(

    hex (0 20 22 3 8 21 23 11) (6 40 1) simpleGrading (1 5 1)//(1 1.1 1) // Block 0
    hex (20 1 2 22 21 9 10 23) (350 40 1) simpleGrading (1 5 1)//(1 1.1 1) // Block 0
    hex (18 0 3 16 19 8 11 17) (20 40 1) simpleGrading (1 5 1)//(1 1.1 1) // Block 1
    hex (16 7 4 18 17 15 12 19) (20 40 1) simpleGrading (1 0.2 1)//(1 0.9 1) // Block 2
    hex (7 6 5 4 15 14 13 12) (8 40 1) simpleGrading (1 0.2 1)//(1 0.9 1) // Block 3


);

edges
(
    //Curved edges for ellipse
    spline 18 0 (
                (0   -1     0)
                (0.1 -0.859 0)
                (0.5 -0.69  0)
                (1   -0.564 0)
                (1.5 -0.482 0)
                (2 -0.414 0)
                //(2 -0.414 0)
                /*(3 -0.31 0)
                (4 -0.23 0)
                (5 -0.174 0)
                (6 -0.129 0)
                (7 -0.093 0)
                (8 -0.067 0)*/

        )
    spline 19 8 (
            (0   -1     0.1)
            (0.1 -0.859 0.1)
                (0.5 -0.69  0.1)
                (1 -0.564 0.1)
                (1.5 -0.482 0.1)
                (2 -0.414 0.1)
                /*(3 -0.31 0.1)
                (4 -0.23 0.1)
                (5 -0.174 0.1)
                (6 -0.129 0.1)
                (7 -0.093 0.1)
                (8 -0.067 0.1)
                */)
    spline 0 20( //(2 -0.413 0)
            (2.2 -0.39 0)
                (2.5 -0.357 0)
                (3 -0.309 0)
                (4 -0.232 0)
                (5 -0.173 0)
                (6 -0.128 0)
                (7 -0.094 0)
                (7.5 -0.079 0)
                (8 -0.067 0)
                (9 -0.047 0)
                (10 -0.032 0)
                (11 -0.021 0)
                (12 -0.013 0)
                (16.5 0 0)
                //(17.5 0 0)
                //(20 0 0)
                )

    spline 8 21( //(2 -0.413 0.1)
                (2.2 -0.39 0.1)
                (2.5 -0.357 0.1)
                (3 -0.309 0.1)
                (4 -0.232 0.1)
                (5 -0.173 0.1)
                (6 -0.128 0.1)
                (7 -0.094 0.1)
                (7.5 -0.079 0.1)
                (8 -0.067 0.1)
                (9 -0.047 0.1)
                (10 -0.032 0.1)
                (11 -0.021 0.1)
                (12 -0.013 0.1)
                (16.5 0 0.1)
                //(17.5 0 0.1)
                //(20 0 0.1)
                )


    spline 4 18
              /* ((8 -1.94 0)
                (7 -1.91 0)
                (6 -1.87 0)
                (5 -1.83 0)
                (4 -1.77 0)
                (3 -1.69 0)*/
               ( (2 -1.59 0)
                (1 -1.43 0)
                (0.5 -1.31 0)
                (0.1 -1.141 0)
        )
    spline 12 19    (/*(8 -1.94 0.1)
                (7 -1.91 0.1)
                (6 -1.87 0.1)
                (5 -1.83 0.1)
                (4 -1.77 0.1)
                (3 -1.69 0.1)*/
                (2 -1.59 0.1)
                (1 -1.43 0.1)
                (0.5 -1.31 0.1)
                (0.1 -1.141 0.1)
                )
                //(0 -1 0.1)
    spline 5 4
               ( (16.5 -2  0)
               (11 -1.979 0)
               (10.5 -1.974 0)
               (10.2 -1.971 0)
               (10 -1.968 0)
               (9.5 -1.961 0)
               (9 -1.953 0)
               (8 -1.94 0)
                (7 -1.91 0)
                (6 -1.87 0)
                (5 -1.83 0)
                (4 -1.77 0)
                (3 -1.69 0)
                (2.5 -1.643 0)
                (2.2 -1.61 0)
               // (2 -1.59 0)
               )
    spline 13 12
               ((16.5 -2 0.1)
               (11 -1.979 0.1)
               (10.5 -1.974 0.1)
               (10.2 -1.971 0.1)
               (10 -1.968 0.1)
               (9.5 -1.961 0.1)
               (9 -1.953 0.1)
                (8 -1.94 0.1)
                (7 -1.91 0.1)
                (6 -1.87 0.1)
                (5 -1.83 0.1)
                (4 -1.77 0.1)
                (3 -1.69 0.1)
                (2.5 -1.643 0.1)
                (2.2 -1.61 0.1)
                //(2 -1.59 0.1)
                )


    arc  3 16 origin (2 -1 0)
    arc  11 17 origin (2 -1 0.1)
    arc  16 7 origin (2 -1 0)
    arc  17 15 origin (2 -1 0.1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
                (3 11 17 16)
                (16 17 15 7)
        );
    }

    outlet
    {
        type patch;
        faces
        (
                (10 2 1 9)
                (13 5 6 14)
        );
    }

    upperWall
    {
        type patch;
        faces
        (
                (11 3 22 23)
                (23 22 2 10)
        );
    }

    plate
    {
        type wall;
        faces
        (
                (8 0 18 19)
                (19 18 4 12)
                (13 12 4 5)
                (21 20 0 8)
                (9 1 20 21)
        );
    }

    lowerWall
    {
        type patch;
        faces
        (
            (14 6 7 15)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (	(21 23 10 9)
            (20 1 2 22)
            (8 11 23 21)
            (0 20 22 3)
            (19 17 11 8)
            (18 0 3 16)
            (17 19 12 15)
            (7 4 18 16)
            (7 6 5 4)
            (15 12 13 14)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
